{
    "lookupData": [
        {
            "id": "ct1-esbs-errorCodeMessages",
            "value": "{\"angular\":{\"dataContainer\":{\"item\":[{\"key\":\"Esbs1\",\"value\":\"A general system error has occurred. Please try again or contact UPS Technical Support.\"},{\"key\":\"Esbs2\",\"value\":\"Your collection request cannot be completed at this time. Please try again or contact UPS.\"},{\"key\":\"We are having temporary technical issues. Please refresh your browser and try again.\",\"value\":\"Esbs3\"},{\"key\":\"Esbs4\",\"value\":\"One or more fields contains invalid data. Please correct or clear the data to continue your shipment.\"},{\"key\":\"EsbsShipmentProcessingUnderway\",\"value\":\"Your payment is still processing; please refresh the screen in a moment to confirm your shipment.\"},{\"key\":\"EsbsCountryInfoUnavailable\",\"value\":\"Country Info is unavailable; please refresh the page to try again.\"},{\"key\":\"EsbsPickupCountryInfoUnavailable\",\"value\":\"Collection Country Info is unavailable; please refresh the page to try again.\"},{\"key\":\"EsbsFraud\",\"value\":\"UPS internal security measures prevent the processing of this shipment. If you believe you have received this message in error, contact UPS on 03457-877-877 (UPS: 81291)\"},{\"key\":\"20007\",\"value\":\"A required field is missing\"},{\"key\":\"20008\",\"value\":\"A field contains invalid data\"},{\"key\":\"20010\",\"value\":\"The phone number contains invalid characters\"},{\"key\":\"110007\",\"value\":\"No services found for origin and destination addresses.\"},{\"key\":\"110610\",\"value\":\"The C.O.D. amount is invalid. Please check the value entered\"},{\"key\":\"110617\",\"value\":\"The parcel&apos;s declared value cannot exceed a value of 999\"},{\"key\":\"110621\",\"value\":\"The maximum parcel declared value amount was exceeded\"},{\"key\":\"110801\",\"value\":\"Address Validation Error on Return address\"},{\"key\":\"110802\",\"value\":\"Address Validation Error on Ship To Address\"},{\"key\":\"110803\",\"value\":\"Address Validation Error on Ship From address\"},{\"key\":\"111005\",\"value\":\"The C.O.D. option cannot be combined with the Return Services option.\"},{\"key\":\"111010\",\"value\":\"Hazardous materials cannot be shipped using Return Services.\"},{\"key\":\"111015\",\"value\":\"The Saturday Delivery option cannot be combined with the Return Services option.\"},{\"key\":\"111020\",\"value\":\"The selected delivery confirmation/signature option cannot be combined with the Return Services option.\"},{\"key\":\"111025\",\"value\":\"The maximum declared amount was exceeded.\"},{\"key\":\"111030\",\"value\":\"Parcels must weigh more than zero pounds.\"},{\"key\":\"111031\",\"value\":\"Parcel must weigh more than zero kg.\"},{\"key\":\"111035\",\"value\":\"The maximum per-parcel weight for the selected service has been exceeded\"},{\"key\":\"111040\",\"value\":\"The Return Services accessories are unavailable with the requested service.\"},{\"key\":\"111045\",\"value\":\"The Saturday Delivery option is not available with the requested service.\"},{\"key\":\"111047\",\"value\":\"Saturday Delivery may not be combined with this product and container type.\"},{\"key\":\"111050\",\"value\":\"The parcel exceeds the maximum parcel size\"},{\"key\":\"111055\",\"value\":\"Parcel exceeds the maximum length constraint of 108 inches.\"},{\"key\":\"111056\",\"value\":\"This parcel exceeds the maximum length constraint of 270 cm.\"},{\"key\":\"111063\",\"value\":\"The requested accessory cannot be combined with the selected service.\"},{\"key\":\"111070\",\"value\":\"The requested accessory is not allowed with this pickup method.\"},{\"key\":\"111085\",\"value\":\"The requested accessory cannot be added to this shipment\"},{\"key\":\"111091\",\"value\":\"The selected service is unavailable to an extended area.\"},{\"key\":\"111095\",\"value\":\"A zone cannot be determined for the parcel\"},{\"key\":\"111100\",\"value\":\"The requested service is invalid for the selected site.\"},{\"key\":\"111105\",\"value\":\"The requested accessory key is invalid for the selected site.\"},{\"key\":\"111107\",\"value\":\"An origin postal code must be specified.\"},{\"key\":\"111115\",\"value\":\"The COD amount must be greater than zero.\"},{\"key\":\"111116\",\"value\":\"The declared value amount must be greater than zero.\"},{\"key\":\"111120\",\"value\":\"The COD amount cannot exceed $1,000 when a cashiers cheque or money order is requested.\"},{\"key\":\"111121\",\"value\":\"The COD value entered exceeds the maximum allowed for cash\"},{\"key\":\"111125\",\"value\":\"The COD amount cannot exceed $50,000.\"},{\"key\":\"111126\",\"value\":\"The C.O.D. value entered exceeds the maximum allowed for a cheque\"},{\"key\":\"111128\",\"value\":\"The maximum Access Point C.O.D. amount has been exceeded\"},{\"key\":\"111129\",\"value\":\"The currency of the Access Point C.O.D. amount must be the same as the Destination country&apos;s currency.\"},{\"key\":\"111130\",\"value\":\"The Saturday Pickup option cannot be combined with the Return Services option.\"},{\"key\":\"111135\",\"value\":\"The Saturday Pickup option cannot be combined with the Saturday Delivery option.\"},{\"key\":\"111140\",\"value\":\"The Saturday Pickup option is unavailable with the selected service.\"},{\"key\":\"111145\",\"value\":\"Only one signature option is allowed.\"},{\"key\":\"111150\",\"value\":\"The selected delivery confirmation/signature option is unavailable with the selected service.\"},{\"key\":\"111155\",\"value\":\"The COD option is unavailable with the selected service.\"},{\"key\":\"111160\",\"value\":\"The requested accessory option is unavailable with the selected billing option.\"},{\"key\":\"111180\",\"value\":\"Consignee Billing is not available with the selected service.\"},{\"key\":\"111185\",\"value\":\"The selected service is not available for the desired country\"},{\"key\":\"111195\",\"value\":\"The requested billing option is unavailable with the selected service.\"},{\"key\":\"111196\",\"value\":\"The requested billing option is unavailable with UPS Letters.\"},{\"key\":\"111200\",\"value\":\"The requested service Saturday Delivery is not available for the selected location.\"},{\"key\":\"111205\",\"value\":\"The Additional Handling option is unavailable with the selected service.\"},{\"key\":\"111206\",\"value\":\"The Additional Handling option is unavailable with UPS Letters.\"},{\"key\":\"111210\",\"value\":\"The service is not valid between the origin and destination. Please correct your ship from and ship to address information to complete a shipment.\"},{\"key\":\"111211\",\"value\":\"The requested accessory option is unavailable between the selected locations.\"},{\"key\":\"111212\",\"value\":\"The requested type of container is not available between the selected locations.\"},{\"key\":\"111213\",\"value\":\"The requested billing option is unavailable between the selected locations.\"},{\"key\":\"111214\",\"value\":\"Cannot ship between the selected locations.\"},{\"key\":\"111215\",\"value\":\"The requested service is unavailable to residential destinations.\"},{\"key\":\"111216\",\"value\":\"No Services Available\"},{\"key\":\"111217\",\"value\":\"The requested service is not available between the selected locations\"},{\"key\":\"111219\",\"value\":\"The requested service is unavailable between the selected locations. Please check your Documents Only, Letter/Envelope, and Saturday Delivery settings as these may affect service availability.\"},{\"key\":\"111220\",\"value\":\"The Ship Notification option cannot be combined with the Return Services option.\"},{\"key\":\"111222\",\"value\":\"A shipment using the Return Services Electronic Return Label option must contain only Goods in Free Circulation.\"},{\"key\":\"111225\",\"value\":\"The Return Services option is unavailable to the selected location.\"},{\"key\":\"111230\",\"value\":\"Next Day Air Early is not available with the selected service.\"},{\"key\":\"111231\",\"value\":\"Switzerland Domestic Container must weigh greater than or equal to 2 KG.\"},{\"key\":\"111232\",\"value\":\"Worldwide Express Plus from Europe to Switzerland must be a UPS Envelope or document only.\"},{\"key\":\"111235\",\"value\":\"Some of the options on the shipment may not be combined\"},{\"key\":\"111240\",\"value\":\"An accessory has been added to the parcel too many times\"},{\"key\":\"111245\",\"value\":\"The Saturday Pickup option cannot be combined with the Shipper Duty Fees option.\"},{\"key\":\"111250\",\"value\":\"The Saturday Delivery option cannot be combined with the Shipper Duty Fees option.\"},{\"key\":\"111255\",\"value\":\"The Shipper Duty Fee option is unavailable with the selected service.\"},{\"key\":\"111260\",\"value\":\"The Shipper Duty Fee option is unavailable with the selected billing option.\"},{\"key\":\"111261\",\"value\":\"The requested option is unavailable with the selected service.\"},{\"key\":\"111262\",\"value\":\"The accessory is not valid with the selected option.\"},{\"key\":\"111265\",\"value\":\"The requested billing option is unavailable to the selected location.\"},{\"key\":\"111266\",\"value\":\"The requested currency is not a legal tender in this country.\"},{\"key\":\"111285\",\"value\":\"The postcode is invalid\"},{\"key\":\"111286\",\"value\":\"The county/state is invalid\"},{\"key\":\"111290\",\"value\":\"The requested billing option is invalid.\"},{\"key\":\"111295\",\"value\":\"A parcel failed validation\"},{\"key\":\"111300\",\"value\":\"The Shipper Pays Duty - VAT Unpaid option is unavailable with the selected option.\"},{\"key\":\"111305\",\"value\":\"The Shipper Pays Duty - VAT Unpaid option is unavailable with the selected service.\"},{\"key\":\"111310\",\"value\":\"The Shipper Pays Duty - VAT Unpaid option is unavailable with the selected billing option.\"},{\"key\":\"111330\",\"value\":\"The Certificate of Origin is unavailable with the selected accessory.\"},{\"key\":\"111335\",\"value\":\"The Certificate of Origin is unavailable with the selected service.\"},{\"key\":\"111340\",\"value\":\"The Certificate of Origin is unavailable with the selected billing option.\"},{\"key\":\"111343\",\"value\":\"The Certificate of Origin is unavailable from the selected origin.\"},{\"key\":\"111345\",\"value\":\"The EEI is unavailable with the selected accessory.\"},{\"key\":\"111350\",\"value\":\"The EEI is unavailable with the selected service.\"},{\"key\":\"111355\",\"value\":\"The EEI is unavailable with the selected billing option.\"},{\"key\":\"111360\",\"value\":\"The Worldwide Express Plus is not available with the selected service.\"},{\"key\":\"111363\",\"value\":\"The One Time Pickup is unavailable with the selected service.\"},{\"key\":\"111365\",\"value\":\"The requested service is not available through the selected acquisition type.\"},{\"key\":\"111370\",\"value\":\"Unsupported acquisition type.\"},{\"key\":\"111375\",\"value\":\"The requested service is not valid for shipments containing more than one parcel.\"},{\"key\":\"111460\",\"value\":\"hipments cannot exceed a C.O.D. amount of 5000 when requesting a banker&apos;s draft or money order.\"},{\"key\":\"111500\",\"value\":\"Special rates are not available for the selected service using the requested containers.\"},{\"key\":\"111501\",\"value\":\"The selected container is not valid with the requested accessory option.\"},{\"key\":\"111502\",\"value\":\"The selected country only allows Return Services\"},{\"key\":\"111510\",\"value\":\"Unsupported container type requested.\"},{\"key\":\"111511\",\"value\":\"Unsupported accessory requested.\"},{\"key\":\"111512\",\"value\":\"Unsupported billing option requested.\"},{\"key\":\"111513\",\"value\":\"Unsupported service requested.\"},{\"key\":\"111515\",\"value\":\"The weight exceeds the maximum for rating the parcel type\"},{\"key\":\"111630\",\"value\":\"The requested accessorial is only valid for a Hold for Collection at a UPS Access Point? shipment indication type.\"},{\"key\":\"111655\",\"value\":\"The requested billing/payment option is not available with the selected shipment indication type for a shipment to a UPS Access Point? location.\"},{\"key\":\"112045\",\"value\":\"The payer of transportation&apos;s country is not valid for Carbon Neutral shipments.\"},{\"key\":\"112051\",\"value\":\"Shipment total weight has exceeded the maximum shipment weight limit of 99,999.9 kg or 99,999.9 lb.\"},{\"key\":\"112052\",\"value\":\"Total pieces in the shipment have exceeded the maximum allowed of 99,999 for a shipment.\"},{\"key\":\"112053\",\"value\":\"The number of pieces was not provided - Number of pieces in a shipment is required to process the shipment.\"},{\"key\":\"112054\",\"value\":\"Length, width and height are required for all pallets in the shipment\"},{\"key\":\"112055\",\"value\":\"The maximum per-pallet weight for the service from the selected origin was exceeded\"},{\"key\":\"112057\",\"value\":\"The maximum per-pallet weight for the service to the selected destination was exceeded\"},{\"key\":\"112059\",\"value\":\"The maximum dimensions for the pallet for the selected origin were exceeded\"},{\"key\":\"112061\",\"value\":\"The maximum dimensions for the pallet for the selected destination were exceeded\"},{\"key\":\"112063\",\"value\":\"Please contact customer service centre for capacity authorisation.\"},{\"key\":\"112064\",\"value\":\"Lift Gate for Collection and Delivery is not allowed when both Hold for Collection and Drop Off at UPS Facility is requested.\"},{\"key\":\"112065\",\"value\":\"Lift Gate for Collection is not allowed with the Drop Off at UPS Facility accessorial.\"},{\"key\":\"112066\",\"value\":\"Lift Gate for Delivery is not allowed with the Hold for Collection accessorial.\"},{\"key\":\"112067\",\"value\":\"More than one type of insurance is not allowed for a shipment ? only one type can exist per shipment\"},{\"key\":\"112068\",\"value\":\"The maximum declared value amount was exceeded\"},{\"key\":\"112082\",\"value\":\"The maximum Dry Ice for a pallet/shipment is 200 kg or 440 lb.\"},{\"key\":\"112083\",\"value\":\"Invalid pallet dimensions, the length must be longer than the width.\"},{\"key\":\"112084\",\"value\":\"The shipper is not eligible to ship Dry Ice.\"},{\"key\":\"112091\",\"value\":\"Missing or Invalid Regulation Set.\"},{\"key\":\"112096\",\"value\":\"Missing or Invalid Dry Ice Weight.\"},{\"key\":\"112101\",\"value\":\"Invalid weight. The Dry Ice weight is greater than the actual parcel weight.\"},{\"key\":\"112107\",\"value\":\"The Saturday Delivery option cannot be combined with the UPS Import Control option.\"},{\"key\":\"112109\",\"value\":\"Itemised Charges are not valid for this service.\"},{\"key\":\"112110\",\"value\":\"The account is not authorised for the UPS Exchange service.\"},{\"key\":\"112113\",\"value\":\"The UPS Account is not authorised for Hold for Collection at a UPS Access Point? location.\"},{\"key\":\"112114\",\"value\":\"Alternative Delivery Address information is required for Hold for Collection at a UPS Access Point? location.\"},{\"key\":\"112116\",\"value\":\"The requested billing option is unavailable between the selected locations with the selected options.\"},{\"key\":\"112117\",\"value\":\"The parcel exceeds the maximum length\"},{\"key\":\"112119\",\"value\":\"The maximum per-parcel weight for the selected option has been exceeded\"},{\"key\":\"112136\",\"value\":\"The Shipment Level Access Point C.O.D. option is not available with the selected service and/or with the shipment&apos;s origin/destination.\"},{\"key\":\"112137\",\"value\":\"The Parcel Level Access Point C.O.D. is not valid for the shipment&apos;s origin and/or destination.\"},{\"key\":\"112139\",\"value\":\"The request contains invalid data e.g. special characters etc. Please correct.\"},{\"key\":\"112140\",\"value\":\"Your UPS Account number is not authorised for the UPS Access Point? Economy service when selecting Hold for Collection at a UPS Access Point? location Shipment Indication Type.\"},{\"key\":\"112141\",\"value\":\"Your UPS Account number is not authorised for the UPS Access Point? Economy service when selecting Returns.\"},{\"key\":\"113010\",\"value\":\"A parcel in the shipment contains a warning.\"},{\"key\":\"118400\",\"value\":\"The destination postcode is not valid for the selected destination country. Please verify your postcode.\"},{\"key\":\"119011\",\"value\":\"The maximum declared value amount for the 1-Attempt option is 1,000\"},{\"key\":\"119012\",\"value\":\"The maximum declared value amount for the Print and Mail option is 1,000.\"},{\"key\":\"119013\",\"value\":\"The maximum declared value amount for the Print Return Label option is 1,000.\"},{\"key\":\"119014\",\"value\":\"The maximum declared value amount for the Electronic Delivery option is 1,000.\"},{\"key\":\"119015\",\"value\":\"The maximum declared value amount for the 3-Attempt option is 50,000.\"},{\"key\":\"119058\",\"value\":\"The selected shipper does not support pallet contract service\"},{\"key\":\"119078\",\"value\":\"The maximum dimensions for a pallet are 160 cm by 120 cm by 200 cm.\"},{\"key\":\"119079\",\"value\":\"The requested service is not valid with pallets with a weight greater than 1,000 kg. Please select Dedicated Parcel Courier Same-Day Service.\"},{\"key\":\"119080\",\"value\":\"A pallet exceeds the maximum width\"},{\"key\":\"119081\",\"value\":\"A pallet exceeds the maximum height\"},{\"key\":\"119082\",\"value\":\"A pallet exceeds the maximum length\"},{\"key\":\"119083\",\"value\":\"A pallet exceeds the maximum weight\"},{\"key\":\"120001\",\"value\":\"XML Shipping System is unavailable, please try again later.\"},{\"key\":\"120020\",\"value\":\"Max parcel per shipment exceeded\"},{\"key\":\"120023\",\"value\":\"Using user-generated forms is not permitted. Please attach your user-generated forms with your shipment.\"},{\"key\":\"120024\",\"value\":\"Uploading your user-generated International Forms was not successful. Please attach the international forms to your shipment.\"},{\"key\":\"120029\",\"value\":\"Worldwide Express Freight Shipment Service Option is not available for Return Shipments.\"},{\"key\":\"120030\",\"value\":\"Missing or Invalid Total Number of Pieces in all Pallets in a Shipment.\"},{\"key\":\"120031\",\"value\":\"Exceeds the Total Number of allowed pieces per Worldwide Express Shipment.\"},{\"key\":\"120032\",\"value\":\"The maximum dimensions for a pallet for the selected origin have been exceeded\"},{\"key\":\"120041\",\"value\":\"The maximum per-pallet weight for the selected service from the selected origin has been exceeded\"},{\"key\":\"120043\",\"value\":\"The maximum per-pallet weight for the selected service to the selected destination has been exceeded\"},{\"key\":\"120062\",\"value\":\"The requested billing option is unavailable with the selected packaging\"},{\"key\":\"120100\",\"value\":\"Missing or invalid shipper number\"},{\"key\":\"120101\",\"value\":\"Missing or invalid shipper name\"},{\"key\":\"120102\",\"value\":\"Missing or invalid shipper address line 1\"},{\"key\":\"120103\",\"value\":\"Invalid shipper address line 2\"},{\"key\":\"120104\",\"value\":\"Invalid shipper address line 3\"},{\"key\":\"120105\",\"value\":\"Missing or invalid Shipper Town/City\"},{\"key\":\"120106\",\"value\":\"Missing or invalid Shipper County/Region code\"},{\"key\":\"120107\",\"value\":\"Missing or invalid Shipper Postcode. (Description)\"},{\"key\":\"120108\",\"value\":\"Missing or invalid Shipper Country Code\"},{\"key\":\"120109\",\"value\":\"Missing or invalid Shipper Phone Number\"},{\"key\":\"120110\",\"value\":\"Missing or invalid Shipper Contact\"},{\"key\":\"120111\",\"value\":\"Shipper Email Address cannot exceed 50 characters\"},{\"key\":\"120112\",\"value\":\"Shipper Email Address is an invalid format\"},{\"key\":\"120113\",\"value\":\"Shipper number must only contain alphanumeric characters\"},{\"key\":\"120114\",\"value\":\"Shipper phone extension cannot exceed 4 digits.\"},{\"key\":\"120115\",\"value\":\"Shipper Phone Number must be at least 10 alphanumeric characters\"},{\"key\":\"120116\",\"value\":\"Shipper phone extension only must contain numbers\"},{\"key\":\"120117\",\"value\":\"Shipper phone extension is only allowed if the shipper is located in the US, Puerto Rico or Canada\"},{\"key\":\"120118\",\"value\":\"The Shipper&apos;s phone extension is only valid if a phone number is given.\"},{\"key\":\"120120\",\"value\":\"The country associated with the Shipper&apos;s Shipper Number must be the same as the shipment&apos;s Shipper&apos;s Country\"},{\"key\":\"120121\",\"value\":\"The Shipper&apos;s Shipper Number cannot be used for the shipment.\"},{\"key\":\"120122\",\"value\":\"Invalid Shipper Number\"},{\"key\":\"120125\",\"value\":\"Consignee billing is only supported in the US or Puerto Rico\"},{\"key\":\"120200\",\"value\":\"Missing or invalid Ship To Company Name\"},{\"key\":\"120201\",\"value\":\"Missing or invalid Ship To Contact\"},{\"key\":\"120202\",\"value\":\"Missing or invalid Ship To Address Line1\"},{\"key\":\"120203\",\"value\":\"Invalid Ship To Address Line 2\"},{\"key\":\"120204\",\"value\":\"Invalid Ship To Address Line 3\"},{\"key\":\"120205\",\"value\":\"Missing or invalid Ship To Town/City\"},{\"key\":\"120206\",\"value\":\"Missing or invalid Ship To County/Region code\"},{\"key\":\"120207\",\"value\":\"Missing or invalid Ship To Postcode. (Description)\"},{\"key\":\"120208\",\"value\":\"Missing or invalid Ship To Country Code\"},{\"key\":\"120209\",\"value\":\"Missing or invalid Ship To Phone Number\"},{\"key\":\"120210\",\"value\":\"Ship To Email Address cannot exceed 50 characters\"},{\"key\":\"120211\",\"value\":\"Ship To Email Address is an invalid format\"},{\"key\":\"120212\",\"value\":\"Ship To Phone Extension cannot exceed 4 digits\"},{\"key\":\"120213\",\"value\":\"Ship To Phone Number must be at least 10 alphanumeric characters\"},{\"key\":\"120214\",\"value\":\"Ship To Phone Extension must contain only numbers\"},{\"key\":\"120216\",\"value\":\"Ship To Phone Extension is only valid if a phone number is given\"},{\"key\":\"120217\",\"value\":\"Ship To phone number and phone extension together cannot be more than 15 digits\"},{\"key\":\"120218\",\"value\":\"Missing or Invalid Ship To Tax Identification. Tax ID may not exceed 15 characters\"},{\"key\":\"120300\",\"value\":\"Missing or invalid Ship From Company Name\"},{\"key\":\"120301\",\"value\":\"Missing or invalid Ship From Contact\"},{\"key\":\"120302\",\"value\":\"Missing or invalid Ship From Address Line1\"},{\"key\":\"120303\",\"value\":\"Invalid Ship From Address Line 2\"},{\"key\":\"120305\",\"value\":\"Missing or invalid Ship From Town/City\"},{\"key\":\"120306\",\"value\":\"Missing or invalid Ship From County/Region code\"},{\"key\":\"120307\",\"value\":\"Missing or invalid Ship From Postcode. (Description)\"},{\"key\":\"120308\",\"value\":\"Missing or invalid Ship From Country Code\"},{\"key\":\"120309\",\"value\":\"Missing or invalid Ship From Phone Number\"},{\"key\":\"120310\",\"value\":\"Ship From Email Address cannot exceed 50 characters\"},{\"key\":\"120311\",\"value\":\"Ship From Email Address is an invalid format\"},{\"key\":\"120312\",\"value\":\"Ship From Phone Extension cannot exceed 4 characters.\"},{\"key\":\"120313\",\"value\":\"Ship From Phone Number must be at least 10 alphanumeric characters\"},{\"key\":\"120314\",\"value\":\"Ship From Phone Extension must contain only numbers\"},{\"key\":\"120316\",\"value\":\"Ship From Phone Extension is only valid if a phone number is given\"},{\"key\":\"120318\",\"value\":\"Ship From Phone number and phone extension together cannot be more than 15 digits\"},{\"key\":\"120400\",\"value\":\"Missing or invalid shipment payment method\"},{\"key\":\"120402\",\"value\":\"Missing or invalid payment card type\"},{\"key\":\"120403\",\"value\":\"Missing or invalid payment card number\"},{\"key\":\"120404\",\"value\":\"Missing or invalid payment card expiry date\"},{\"key\":\"120406\",\"value\":\"The payment card number is not valid for the payment card type\"},{\"key\":\"120407\",\"value\":\"The payment card provided as the payment method has expired.\"},{\"key\":\"120408\",\"value\":\"Missing payment card type\"},{\"key\":\"120412\",\"value\":\"The UPS Account Number that was provided as the payment method is missing or invalid.\"},{\"key\":\"120414\",\"value\":\"Payment card authorisation failed, contact your financial institution\"},{\"key\":\"120415\",\"value\":\"A single billing option is required per shipment\"},{\"key\":\"120417\",\"value\":\"The account number for FRS payment information is not FRS-enabled\"},{\"key\":\"120437\",\"value\":\"The third-party or freight-collect shipper&apos;s postcode is missing or invalid.\"},{\"key\":\"120444\",\"value\":\"Invalid Bill-To Type\"},{\"key\":\"120500\",\"value\":\"Missing or invalid Service Code\"},{\"key\":\"120501\",\"value\":\"Invalid Shipment Reference Number Value\"},{\"key\":\"120502\",\"value\":\"InvoiceLineTotal/MonetaryValue must be greater than 0\"},{\"key\":\"120503\",\"value\":\"Shipment Description cannot exceed 35 characters\"},{\"key\":\"120504\",\"value\":\"InvoiceLineTotal is not allowed for this shipment\"},{\"key\":\"120505\",\"value\":\"The Saturday Delivery Option cannot be used for this shipment\"},{\"key\":\"120506\",\"value\":\"Invalid Shipment Reference Number Code\"},{\"key\":\"120512\",\"value\":\"Shipment Description is required for this shipment.\"},{\"key\":\"120515\",\"value\":\"The memo exceeds the maximum length of 50 characters\"},{\"key\":\"120517\",\"value\":\"The email address exceeds the maximum length of 50 characters\"},{\"key\":\"120518\",\"value\":\"The format of the email address is invalid\"},{\"key\":\"120519\",\"value\":\"An email address is missing or contains invalid characters\"},{\"key\":\"120522\",\"value\":\"Alternative Delivery Time is not valid for any available services\"},{\"key\":\"120523\",\"value\":\"Shipment Documents Only is invalid with the shipment&apos;s origin/destination pair\"},{\"key\":\"120524\",\"value\":\"Parcel Collection Request is not available with this shipment service\"},{\"key\":\"120526\",\"value\":\"InvoiceLineTotal MonetaryValue may not exceed 8 digits\"},{\"key\":\"120530\",\"value\":\"SuiteRoomID length for shipment collection cannot exceed 8 characters\"},{\"key\":\"120531\",\"value\":\"FloorID length for shipment collection cannot exceed 3 characters\"},{\"key\":\"120532\",\"value\":\"Location length for shipment collection cannot exceed 11 characters\"},{\"key\":\"120533\",\"value\":\"The earliest shipment collection time is required\"},{\"key\":\"120534\",\"value\":\"The latest shipment collection time is required\"},{\"key\":\"120535\",\"value\":\"Contact name for shipment collection is required\"},{\"key\":\"120536\",\"value\":\"Contact phone number for shipment collection is required\"},{\"key\":\"120549\",\"value\":\"Invalid Reference Number Barcode Indicator.\"},{\"key\":\"120556\",\"value\":\"Missing or invalid Monetary value for Access Point C.O.D.\"},{\"key\":\"120557\",\"value\":\"Missing or invalid Currency code for Access Point C.O.D.\"},{\"key\":\"120558\",\"value\":\"Alternative Delivery Address information is required for UPS Access Point? Delivery.\"},{\"key\":\"120559\",\"value\":\"A UAP shipper notification code (013) and notification data (email or phone number) is required for UPS Access Point? Delivery.\"},{\"key\":\"120560\",\"value\":\"An ADL notification code (012) and notification data (email or phone number) is required for UPS Access Point? Delivery.\"},{\"key\":\"120561\",\"value\":\"Missing or invalid Alternative Payment Method.\"},{\"key\":\"120562\",\"value\":\"PayPal is not supported for this shipment.\"},{\"key\":\"120567\",\"value\":\"Missing or invalid PayPal Information. Verify your User ID and associated PayPal information.\"},{\"key\":\"120568\",\"value\":\"The Shipment Level Access Point C.O.D. option is not available with the selected service, UPS account type and/or with the shipment&apos;s origin/destination.\"},{\"key\":\"120570\",\"value\":\"Total Shipment Charges exceed the customer&apos;s PayPal account limit.\"},{\"key\":\"120571\",\"value\":\"ADL notification and UAP Shipper Notification are required for UPS Access Point? Delivery.\"},{\"key\":\"120572\",\"value\":\"UPS internal security measures prevent the processing of this shipment. If you believe you have received this message in error, contact UPS on 03457-877-877 (UPS: 81291)\"},{\"key\":\"120573\",\"value\":\"Notification Media Type is missing or invalid.\"},{\"key\":\"120574\",\"value\":\"UPS internal security measures prevent the processing of this shipment. Please contact your UPS Account Representative for assistance with this issue.\"},{\"key\":\"120575\",\"value\":\"UPS encountered an error while processing a shipment request with PayPal Payment. Please enter another Payment Type to complete your shipment.\"},{\"key\":\"120576\",\"value\":\"UPS Access Point? Economy Service shipments must have a Hold for Collection at a UPS Access Point? or UPS Access Point? Delivery Shipment Indication Type or must be a Return shipment.\"},{\"key\":\"120578\",\"value\":\"Missing or invalid Parcel Release Code. The Parcel Release Code must be 4-6 characters in length and only include numbers\"},{\"key\":\"120597\",\"value\":\"Invalid C.O.D. currency code. Please use the destination country currency code.\"},{\"key\":\"120598\",\"value\":\"Parcel delivery confirmation/signature is not allowed with the shipment origin/destination.\"},{\"key\":\"120600\",\"value\":\"Missing Parcel Packaging Type Code\"},{\"key\":\"120601\",\"value\":\"Missing or invalid Parcel Weight\"},{\"key\":\"120602\",\"value\":\"Missing or invalid Combination of parcel length, width and height values.\"},{\"key\":\"120603\",\"value\":\"Invalid Parcel Reference Value\"},{\"key\":\"120604\",\"value\":\"Invalid Parcel Declared Value\"},{\"key\":\"120605\",\"value\":\"Mismatch Parcel Dimensions with Parcel Type\"},{\"key\":\"120606\",\"value\":\"Mismatch Parcel Dimensions, Parcel Type and Parcel Weight\"},{\"key\":\"120607\",\"value\":\"Invalid Parcel Reference Code\"},{\"key\":\"120608\",\"value\":\"Parcel Weight is required\"},{\"key\":\"120609\",\"value\":\"All Parcel Dimensions are required and each must be greater than 0\"},{\"key\":\"120610\",\"value\":\"Invalid C.O.D. monetary value\"},{\"key\":\"120611\",\"value\":\"The verbal confirmation contact name cannot exceed 35 characters\"},{\"key\":\"120612\",\"value\":\"The verbal confirmation contact name cannot exceed 15 characters\"},{\"key\":\"120613\",\"value\":\"The verbal confirmation contact name must be at least 10 alphanumeric characters\"},{\"key\":\"120614\",\"value\":\"The verbal confirmation contact phone extension cannot exceed 4 characters\"},{\"key\":\"120615\",\"value\":\"The verbal confirmation contact phone extension must only contain numbers\"},{\"key\":\"120616\",\"value\":\"Parcel Weight cannot exceed a 6 digits\"},{\"key\":\"120618\",\"value\":\"Contact Name is required for verbal confirmation of delivery\"},{\"key\":\"120619\",\"value\":\"Contact Phone Number is required for verbal confirmation of delivery\"},{\"key\":\"120620\",\"value\":\"Parcel Parcel Weight, Parcel Dimensional Weight, Parcel Oversize Parcel and Parcel Dimensions do not apply to UPS Envelopes\"},{\"key\":\"120622\",\"value\":\"Parcel Description is required\"},{\"key\":\"120623\",\"value\":\"Invalid Parcel Description\"},{\"key\":\"120624\",\"value\":\"Only one parcel is allowed for this movement.\"},{\"key\":\"120626\",\"value\":\"The C.O.D. Funds Code is invalid. Please check the value entered\"},{\"key\":\"120644\",\"value\":\"Label Delivery is not valid with the shipment\"},{\"key\":\"120654\",\"value\":\"No more than two email addresses for Receiver Return Notification are allowed in a shipment.\"},{\"key\":\"120655\",\"value\":\"Receiver Return Notification is only allowed to be specified on the first parcel that has Receiver Return Notification.\"},{\"key\":\"120661\",\"value\":\"The maximum number of notifications was exceeded\"},{\"key\":\"120662\",\"value\":\"The Subject of the Notification is invalid\"},{\"key\":\"120663\",\"value\":\"The From Name of the Notification is invalid\"},{\"key\":\"120664\",\"value\":\"The Email Address of the Notification is invalid\"},{\"key\":\"120665\",\"value\":\"The From Email Address of the Notification is invalid\"},{\"key\":\"120666\",\"value\":\"The Subject Text of the Notification is invalid\"},{\"key\":\"120687\",\"value\":\"Missing or Invalid Page Size for the UPS Premium Care Form.\"},{\"key\":\"120688\",\"value\":\"Missing or Invalid Print Type for UPS Premium Care Form.\"},{\"key\":\"120689\",\"value\":\"A UPS Premium Care Form is required if the UPS Premium Care Accessorial is requested.\"},{\"key\":\"120690\",\"value\":\"Missing or Invalid Number of Copies for the UPS Premium Care Form.\"},{\"key\":\"120691\",\"value\":\"Missing or Invalid Languages for the UPS Premium Care Form.\"},{\"key\":\"120692\",\"value\":\"Two Languages are required for the UPS Premium Care Form.\"},{\"key\":\"120693\",\"value\":\"Missing or Invalid Shipment Date for the UPS Premium Care Form\"},{\"key\":\"120695\",\"value\":\"Missing or Invalid Packaging Type Quantity.\"},{\"key\":\"120704\",\"value\":\"Missing/Invalid Label Specification Label Stock Size Height\"},{\"key\":\"120705\",\"value\":\"Missing/Invalid Label Specification Label Stock Size Width.\"},{\"key\":\"120759\",\"value\":\"Movement Reference Number must only contain alphanumeric characters.\"},{\"key\":\"120760\",\"value\":\"Movement Reference Number must be 18 characters.\"},{\"key\":\"120761\",\"value\":\"Invalid Movement Reference Number. The Third and Fourth Character Must be the Shipper&apos;s Country ISO Code.\"},{\"key\":\"120801\",\"value\":\"Address Validation Error on Return address\"},{\"key\":\"120802\",\"value\":\"Address Validation Error on Ship To Address\"},{\"key\":\"120803\",\"value\":\"Address Validation Error on Ship From address\"},{\"key\":\"120969\",\"value\":\"Invalid notification language length.\"},{\"key\":\"120970\",\"value\":\"Only One Shipment Indication Type is allowed in a request.\"},{\"key\":\"120972\",\"value\":\"The UPS Account is not authorised for hold for collection at a UPS Access Point? Shipment.\"},{\"key\":\"120973\",\"value\":\"The maximum length has been exceeded\"},{\"key\":\"120975\",\"value\":\"The maximum parcel weight has been exceeded\"},{\"key\":\"120977\",\"value\":\"The customs value entered exceeds the maximum allowed amount of $2300 USD or $2500 CAD\"},{\"key\":\"120981\",\"value\":\"Missing or invalid Alternative Delivery Address Line information.\"},{\"key\":\"120982\",\"value\":\"Missing or invalid Alternative Delivery Address Town/City.\"},{\"key\":\"120983\",\"value\":\"Missing or invalid Alternative Delivery Address County/Region Code.\"},{\"key\":\"120984\",\"value\":\"Missing or invalid Alternative Delivery Address Postcode.\"},{\"key\":\"120985\",\"value\":\"Missing or invalid Alternative Delivery Address Country Code.\"},{\"key\":\"120986\",\"value\":\"Missing or invalid Alternative Delivery Name.\"},{\"key\":\"120987\",\"value\":\"Missing or invalid Alternative Delivery Address Contact Name.\"},{\"key\":\"120988\",\"value\":\"Missing or invalid Shipment Indication Type Code.\"},{\"key\":\"120989\",\"value\":\"Invalid Notification Email Address.\"},{\"key\":\"120990\",\"value\":\"Missing or invalid Alternative Delivery Address Information.\"},{\"key\":\"120991\",\"value\":\"Invalid Notification Dialect Length.\"},{\"key\":\"120992\",\"value\":\"Notification Language ? dialect pair not valid.\"},{\"key\":\"120993\",\"value\":\"Notification Phone Number is missing.\"},{\"key\":\"120994\",\"value\":\"Notification Phone Number may not exceed 15 digits.\"},{\"key\":\"120995\",\"value\":\"An ADL notification code (012) and notification data (email or phone number) are required for a hold for collection at an Access Point location shipment.\"},{\"key\":\"120996\",\"value\":\"Invalid Alternative Delivery Address Line 2\"},{\"key\":\"120997\",\"value\":\"Invalid Alternative Delivery Address Line 3.\"},{\"key\":\"120998\",\"value\":\"UPS Access Point? ID is valid only for a Direct to Retail Shipment.\"},{\"key\":\"120999\",\"value\":\"Missing or invalid UPS Access Point? ID.\"},{\"key\":\"121006\",\"value\":\"The COD option cannot be combined with the UPS Import Control option.\"},{\"key\":\"121021\",\"value\":\"The selected delivery confirmation/signature option cannot be combined with the UPS Import Control option.\"},{\"key\":\"121025\",\"value\":\"The maximum declared amount of 50,000 has been exceeded\"},{\"key\":\"121031\",\"value\":\"Parcel must weigh more than zero kg\"},{\"key\":\"121040\",\"value\":\"Return Services are not available with the requested service.\"},{\"key\":\"121041\",\"value\":\"The UPS Import Control accessories are unavailable with the requested service.\"},{\"key\":\"121047\",\"value\":\"Saturday Delivery may not be combined with the Parcel Type for the given product.\"},{\"key\":\"121050\",\"value\":\"The maximum total parcel size was exceeded\"},{\"key\":\"121057\",\"value\":\"The measurement system is not valid\"},{\"key\":\"121063\",\"value\":\"The requested accessorial cannot be shipped with the selected service.\"},{\"key\":\"121085\",\"value\":\"The requested accessory cannot be added to the shipment.\"},{\"key\":\"121087\",\"value\":\"The Authorised Return Service option is not allowed for shipments.\"},{\"key\":\"121100\",\"value\":\"The selected service is invalid for the shipment origin.\"},{\"key\":\"121105\",\"value\":\"The given accessory key is invalid for the shipment origin.\"},{\"key\":\"121106\",\"value\":\"The specified country, origin or destination, is not supported.\"},{\"key\":\"121107\",\"value\":\"A blank origin postal address was specified\"},{\"key\":\"121115\",\"value\":\"The C.O.D. amount must be greater than zero\"},{\"key\":\"121121\",\"value\":\"The COD value entered exceeds the maximum allowed for cash\"},{\"key\":\"121126\",\"value\":\"The C.O.D. value entered exceeds the maximum allowed for a cheque\"},{\"key\":\"121128\",\"value\":\"The C.O.D. value entered exceeds the maximum allowed\"},{\"key\":\"121131\",\"value\":\"The Saturday Collection option cannot be combined with the UPS Import Control option.\"},{\"key\":\"121140\",\"value\":\"Saturday Collection is not available with the selected service.\"},{\"key\":\"121150\",\"value\":\"The selected delivery confirmation/signature is unavailable with the selected service.\"},{\"key\":\"121155\",\"value\":\"The C.O.D. option is not available with the selected service, UPS account type and/or with the shipment&apos;s origin/destination pair.\"},{\"key\":\"121156\",\"value\":\"Parcel Level C.O.D. is not valid for the shipment&apos;s origin and/or destination\"},{\"key\":\"121160\",\"value\":\"The accessory is invalid with the billing option.\"},{\"key\":\"121182\",\"value\":\"The payer&apos;s transportation country is not valid for carbon neutral shipments.\"},{\"key\":\"121195\",\"value\":\"The selected billing option is not available with the selected service.\"},{\"key\":\"121196\",\"value\":\"The selected billing option is not available with UPS Letters.\"},{\"key\":\"121200\",\"value\":\"Saturday Delivery is not available for the desired destination.\"},{\"key\":\"121205\",\"value\":\"Additional Handling is not available with the selected service.\"},{\"key\":\"121206\",\"value\":\"Additional Handling is not available with UPS Letters.\"},{\"key\":\"121208\",\"value\":\"UPS Next Day Air Early service is not available to the requested destination. Please select UPS Next Day Air service as an alternative.\"},{\"key\":\"121210\",\"value\":\"The selected service is not available from the origin to the destination.\"},{\"key\":\"121211\",\"value\":\"A parcel-level accessorial is not available with the shipment&apos;s origin/destination pair. (Description) will be a detailed description based on the shipment.\"},{\"key\":\"121212\",\"value\":\"The requested parcel type is not allowed in a shipment from the origin to the destination\"},{\"key\":\"121213\",\"value\":\"[Rating error description]\"},{\"key\":\"121214\",\"value\":\"UPS cannot ship from the origin country to the destination country\"},{\"key\":\"121215\",\"value\":\"The selected service is not available to residential destinations.\"},{\"key\":\"121225\",\"value\":\"Return Services are not available for the given destination.\"},{\"key\":\"121230\",\"value\":\"Next-Day Air Early Surcharge is not available with the selected service.\"},{\"key\":\"121231\",\"value\":\"A Switzerland Domestic Container must weigh greater than 2 kg\"},{\"key\":\"121232\",\"value\":\"Worldwide Express Plus from Europe to Switzerland must be UPS Envelope or document only\"},{\"key\":\"121255\",\"value\":\"The Shipper Duty Fee is not available with the selected service.\"},{\"key\":\"121260\",\"value\":\"The Shipper Duty Fee is not available with the selected billing option.\"},{\"key\":\"121261\",\"value\":\"The Accessory may not be combined with the product.\"},{\"key\":\"121262\",\"value\":\"The Accessory may not be combined with the accessory.\"},{\"key\":\"121265\",\"value\":\"The selected billing option is not available for the desired country.\"},{\"key\":\"121266\",\"value\":\"The Currency Code is invalid for the shipment.\"},{\"key\":\"121267\",\"value\":\"The Ship From Country is invalid for the payment card.\"},{\"key\":\"121268\",\"value\":\"The Billing Address Country is invalid for the payment card.\"},{\"key\":\"121290\",\"value\":\"The given billing option is invalid\"},{\"key\":\"121315\",\"value\":\"The Authorised Return Service is not available with the selected accessorial.\"},{\"key\":\"121317\",\"value\":\"The UPS Import Control option is unavailable with the selected accessory.\"},{\"key\":\"121320\",\"value\":\"The Authorised Return Service is not available with the selected service.\"},{\"key\":\"121325\",\"value\":\"The Authorised Return Service is unavailable with the selected billing option.\"},{\"key\":\"121330\",\"value\":\">The Certificate of Origin is not available with the selected accessorial.\"},{\"key\":\"121345\",\"value\":\"The EEI is unavailable with the selected accessorial.\"},{\"key\":\"121360\",\"value\":\"The Worldwide Express Plus Surcharge is not available with the selected service.\"},{\"key\":\"121363\",\"value\":\"The One-Off Collection Surcharge is not available with the selected service.\"},{\"key\":\"121365\",\"value\":\"The accessorial is not available with the selected access method.\"},{\"key\":\"121370\",\"value\":\"Invalid access method.\"},{\"key\":\"121375\",\"value\":\"The letter service is invalid for shipments containing more than one parcel. International shipment cannot be made with multiple 10 kg or 25 kg parcels\"},{\"key\":\"121452\",\"value\":\"An Import Control option and a Return Service option are not valid on the same shipment.\"},{\"key\":\"121460\",\"value\":\"Shipments cannot exceed a COD amount of $5,000 when requesting a cashiers cheque or money order.\"},{\"key\":\"121502\",\"value\":\"The selected country does not allow forward movements.\"},{\"key\":\"121510\",\"value\":\"Unsupported Parcel Type.\"},{\"key\":\"121511\",\"value\":\"Unsupported Accessory Type\"},{\"key\":\"121512\",\"value\":\"Unsupported Billing Option\"},{\"key\":\"121513\",\"value\":\"Unsupported Service\"},{\"key\":\"121515\",\"value\":\"The weight of (actual weight) exceeds the maximum for rating the requested container. Using standard parcel rates.\"},{\"key\":\"121520\",\"value\":\"The UPS Account Number specified for Transportation Charges is invalid for a Split Duty VAT shipment.\"},{\"key\":\"121521\",\"value\":\"Invalid Duty and Tax payer\"},{\"key\":\"121523\",\"value\":\"Invalid Goods Not In Free Circulation Indicator\"},{\"key\":\"121524\",\"value\":\"The Duty and Tax payer is not required for UPS Letter, Documents of No Commercial Value or Qualified Domestic Shipments.\"},{\"key\":\"121526\",\"value\":\"The Payment Method specified for Transportation Charges is invalid for the return service.\"},{\"key\":\"121530\",\"value\":\"The Duty and Tax payer is required.\"},{\"key\":\"121531\",\"value\":\"Invalid Split Duty and Tax Indicator\"},{\"key\":\"121532\",\"value\":\"The Duty and Tax payer is invalid for a Split Duty VAT shipment\"},{\"key\":\"121534\",\"value\":\"The Transportation charges payer and the Duty and Tax payer must not be the same for a Split Duty VAT shipment.\"},{\"key\":\"121535\",\"value\":\"The Transportation charges payer is invalid for a Split Duty VAT shipment.\"},{\"key\":\"121536\",\"value\":\"The Bill Receiver payer is invalid for an international return movement.\"},{\"key\":\"121538\",\"value\":\"For a domestic return movement, the freight payer must be in the country of the return movement\"},{\"key\":\"121539\",\"value\":\"For an EU return movement, the payer of the freight must be in an EU country.\"},{\"key\":\"121565\",\"value\":\"The UPS Returns Flexible Access option is unavailable with the requested accessory.\"},{\"key\":\"121570\",\"value\":\"The UPS Returns Flexible Access option is only available with Return Services Print and Mail, Electronic Return Label and Print Return Label.\"},{\"key\":\"121575\",\"value\":\"The UPS Returns Flexible Access option is unavailable with Additional Handling.\"},{\"key\":\"121580\",\"value\":\"The UPS Returns Flexible Access option is unavailable with Large Parcel.\"},{\"key\":\"121585\",\"value\":\"The UPS Returns Flexible Access option is available for US and Puerto Rico shippers only.\"},{\"key\":\"121590\",\"value\":\"The maximum per-parcel weight for the UPS Returns Flexible Access option is...\"},{\"key\":\"121595\",\"value\":\"The maximum length (the longest side) of a UPS Returns Flexible Access parcel is\"},{\"key\":\"121600\",\"value\":\"The maximum length of the second-longest side of a UPS Returns Flexible Access parcel is...\"},{\"key\":\"121605\",\"value\":\"The maximum total size constraint (length + girth, where girth is 2 x width plus 2 x height) of a UPS Returns Flexible Access parcel is ...\"},{\"key\":\"121610\",\"value\":\"The maximum declared value amount for the UPS Returns Flexible Access option is...\"},{\"key\":\"121615\",\"value\":\"All parcels in the shipment must have the UPS Returns Flexible Access option if 1 parcel has it.\"},{\"key\":\"121780\",\"value\":\"Commercial Invoice Removal is valid only for Import Control shipments.\"},{\"key\":\"124022\",\"value\":\"Invalid number of shipment-level notifications\"},{\"key\":\"124078\",\"value\":\"The Notification Media Type is invalid for the given country.\"},{\"key\":\"124079\",\"value\":\"The Notification Language is invalid for the given Notification Media Type Code.\"},{\"key\":\"124998\",\"value\":\"The Receipt Specification applies only for PRL or Exchange Return Receipt.\"},{\"key\":\"124999\",\"value\":\"Invalid Image Format Code\"},{\"key\":\"125000\",\"value\":\"Missing or invalid shipment digest.\"},{\"key\":\"126008\",\"value\":\"All parcels with a Dry Ice Regulation Set must contain the same Regulation Set.\"},{\"key\":\"126009\",\"value\":\"The Dry Ice Regulation Set for non-US PR origins destinations should be IATA.\"},{\"key\":\"126010\",\"value\":\"The Dry Ice Weight cannot be larger than the parcel weight.\"},{\"key\":\"126077\",\"value\":\"Number of Dry Ice items per Parcel is greater than 1.\"},{\"key\":\"126078\",\"value\":\"A Dry Ice item cannot exist on the same parcel as another HazMat.\"},{\"key\":\"126086\",\"value\":\"The Pre-Alert Notification Phone Number is missing\"},{\"key\":\"126087\",\"value\":\"The Pre-Alert Notification Phone Number may not exceed 15 digits\"},{\"key\":\"126088\",\"value\":\"The Pre-Alert Notification Dialect length must be less than or equal to 2\"},{\"key\":\"126089\",\"value\":\"Pre-Alert Notification Language-Dialect Pair invalid\"},{\"key\":\"126090\",\"value\":\"Pre-alerts notification are only valid with UPS Returns Exchange and UPS Returns Pack and Collect shipments\"},{\"key\":\"126091\",\"value\":\"Notification Language is missing\"},{\"key\":\"126092\",\"value\":\"Notification Dialect is missing\"},{\"key\":\"126093\",\"value\":\"Notification Language must be less than or equal to 3\"},{\"key\":\"127000\",\"value\":\"Missing or Invalid Form EEI Filing Option Code. Should be UPS-filed or shipper-filed.\"},{\"key\":\"127001\",\"value\":\"Missing or Invalid Code in UPS-filed. Should indicate a one-off POA or blanket POA.\"},{\"key\":\"127002\",\"value\":\"Missing or Invalid shipper-filed option ? 1a requires the ITN, 1b requires the exemption legend; 1c requires the post-departure filing citation.\"},{\"key\":\"127003\",\"value\":\"Missing or Invalid EEI Filing Option. Required for SDL Shipping Indicator.\"},{\"key\":\"127004\",\"value\":\"Missing or Invalid Ship From Tax ID Type Code. Needed for EEI filing.\"},{\"key\":\"127005\",\"value\":\"The shipper has no power of attorney privilege.\"},{\"key\":\"127006\",\"value\":\"EEI forms cannot be used together.\"},{\"key\":\"127007\",\"value\":\"The shipper has no SDL contract and is not eligible to ship SDL shipments.\"},{\"key\":\"128001\",\"value\":\"Invalid or missing international forms\"},{\"key\":\"128002\",\"value\":\"Invalid or missing forwarding agent company name. Valid length is 1 to 35 alphanumeric characters\"},{\"key\":\"128003\",\"value\":\"Invalid or missing forwarding agent tax ID. Valid length is 1 to 15 alphanumeric characters\"},{\"key\":\"128004\",\"value\":\"Invalid or missing Forwarding Agent Address Line 1. Valid length is 1 to 35 alphanumeric characters\"},{\"key\":\"128005\",\"value\":\"Invalid Forwarding Agent Address Line 2. Valid length is 0 to 35 alphanumeric characters\"},{\"key\":\"128006\",\"value\":\"Invalid Forwarding Agent Address Line 3. Valid length is 0 to 35 alphanumeric characters\"},{\"key\":\"128007\",\"value\":\"Invalid or missing Forwarding Agent City. Valid length is 1 to 30 alphanumeric characters\"},{\"key\":\"128008\",\"value\":\"Invalid Forwarding Agent County/Region Code. Valid length is 0 to 5 alphanumeric characters\"},{\"key\":\"128009\",\"value\":\"Invalid Forwarding Agent Postcode. Valid length is 0 to 9 alphanumeric characters\"},{\"key\":\"128010\",\"value\":\"Invalid or missing Forwarding Agent Country Code\"},{\"key\":\"128011\",\"value\":\"Invalid or missing Ultimate Consignee Company Name. Valid length is 1 to 35 alphanumeric characters\"},{\"key\":\"128012\",\"value\":\"Invalid or missing Ultimate Consignee Address Line 1. Valid length is 1 to 35 alphanumeric characters\"},{\"key\":\"128013\",\"value\":\"Invalid Ultimate Consignee Address Line 2. Valid length is 0 to 35 alphanumeric characters\"},{\"key\":\"128014\",\"value\":\"Invalid Ultimate Consignee Address Line 3. Valid length is 0 to 35 alphanumeric characters\"},{\"key\":\"128015\",\"value\":\"Invalid or missing Ultimate Consignee Town/City. Valid length is 1 to 30 alphanumeric characters\"},{\"key\":\"128016\",\"value\":\"Invalid Ultimate Consignee County/Region Code. Valid length is 0 to 5 alphanumeric characters\"},{\"key\":\"128017\",\"value\":\"Invalid Ultimate Consignee Postcode. Valid length is 0 to 9 alphanumeric characters\"},{\"key\":\"128018\",\"value\":\"Invalid or missing Ultimate Consignee Country Code\"},{\"key\":\"128019\",\"value\":\"Invalid or missing Intermediate Consignee Company Name. Valid length is 1 to 35 alphanumeric characters\"},{\"key\":\"128020\",\"value\":\"Invalid or missing Intermediate Consignee Address Line 1. Valid length is 1 to 35 alphanumeric characters\"},{\"key\":\"128021\",\"value\":\"Invalid Intermediate Consignee Address Line 2. Valid length is 0 to 35 alphanumeric characters\"},{\"key\":\"128022\",\"value\":\"Invalid Intermediate Consignee Address Line 3. Valid length is 0 to 35 alphanumeric characters\"},{\"key\":\"128023\",\"value\":\"Invalid or missing Intermediate ConsigneeTown/City. Valid length is 1 to 30 alphanumeric characters\"},{\"key\":\"128024\",\"value\":\"Invalid Intermediate Consignee County/Region Code. Valid length is 0 to 5 alphanumeric characters\"},{\"key\":\"128025\",\"value\":\"Invalid Intermediate Consignee Postcode. Valid length is 0 to 9 alphanumeric characters\"},{\"key\":\"128026\",\"value\":\"Invalid or missing Intermediate Consignee Country Code\"},{\"key\":\"128027\",\"value\":\"Invalid or missing Producer Option. Valid values are 01, 02, 03 or 04\"},{\"key\":\"128028\",\"value\":\"Invalid or missing Producer Company Name. Valid length is 1 to 35 alphanumeric characters\"},{\"key\":\"128029\",\"value\":\"Invalid or missing Producer Address Line 1. Valid length is 1 to 35 alphanumeric characters\"},{\"key\":\"128030\",\"value\":\"Invalid Producer Address Line 2. Valid length is 0 to 35 alphanumeric characters\"},{\"key\":\"128031\",\"value\":\"Invalid Producer Address Line 3. Valid length is 0 to 35 alphanumeric characters\"},{\"key\":\"128032\",\"value\":\"Invalid or missing Producer Town/City. Valid length is 1 to 30 alphanumeric characters\"},{\"key\":\"128033\",\"value\":\"Invalid Producer County/Region Code. Valid length is 0 to 5 alphanumeric characters\"},{\"key\":\"128034\",\"value\":\"Invalid Producer Postcode. Valid length is 0 to 9 alphanumeric characters\"},{\"key\":\"128035\",\"value\":\"Invalid or missing Producer Country Code\"},{\"key\":\"128036\",\"value\":\"Invalid Telephone Number.\"},{\"key\":\"128046\",\"value\":\"Invalid or missing product unit value for product number. Valid length is 1 to 12 numeric characters and it can hold up to 6 decimal places\"},{\"key\":\"128047\",\"value\":\"Invalid Part Number. Valid length is 0 to 10 alphanumeric characters\"},{\"key\":\"128069\",\"value\":\"Invalid or missing reason for export. Valid length is 1 to 20 alphanumeric\"},{\"key\":\"128070\",\"value\":\"Invalid Additional Comments. Valid length is 0 to 150 alphanumeric characters\"},{\"key\":\"128071\",\"value\":\"Invalid Declaration Statement. Valid length is 0 to 250 alphanumeric characters\"},{\"key\":\"128072\",\"value\":\"Invalid Discount Monetary Value. Valid length is 0 to 15 numeric characters and can hold up to 2 decimal places. The discount cannot be greater than the invoice line total.\"},{\"key\":\"128073\",\"value\":\"Invalid Monetary Value for freight charges. Valid length is 0 to 15 numeric characters and can hold up to 2 decimal places.\"},{\"key\":\"128074\",\"value\":\"Invalid Monetary Value for other charges. Valid length is 0 to 15 numeric characters and can hold up to 2 decimal places.\"},{\"key\":\"128075\",\"value\":\"Invalid or missing Other Charges Description. Valid length is 1 to 10 alphanumeric characters\"},{\"key\":\"128079\",\"value\":\"Invalid or missing Export Carrier. Valid length is 1 to 35 alphanumeric characters\"},{\"key\":\"128080\",\"value\":\"Invalid Carrier ID. Valid length is 0 to 2 alphanumeric characters\"},{\"key\":\"128082\",\"value\":\"Entry number is required when the in-bond code is other than 70. Valid Length is 1 to 25 alpha numeric characters\"},{\"key\":\"128083\",\"value\":\"Invalid or missing Point of Origin. Valid length is 1 to 5 alphanumeric characters\"},{\"key\":\"128084\",\"value\":\"Invalid or missing Mode of Transport. Valid length is 1 to 35 alphanumeric characters\"},{\"key\":\"128085\",\"value\":\"Invalid Port of Export. Valid length is 0 to 35 alphanumeric characters\"},{\"key\":\"128086\",\"value\":\"Invalid Port of Unloading. Valid length is 0 to 35 alphanumeric characters\"},{\"key\":\"128087\",\"value\":\"Invalid Loading Pier. Valid length is 0 to 35 alphanumeric characters\"},{\"key\":\"128089\",\"value\":\"Invalid Licence Number. Valid length is 0 to 35 alphanumeric characters\"},{\"key\":\"128091\",\"value\":\"Invalid Licence Exception Code. Valid length is 0 to 4 alphanumeric characters\"},{\"key\":\"128093\",\"value\":\"Invalid ECCN Number Code. Valid length is 1 to 8 alphanumeric characters\"},{\"key\":\"128095\",\"value\":\"Invalid or missing Sold To Company Name. Valid length is 1 to 35 alphanumeric characters\"},{\"key\":\"128096\",\"value\":\"Invalid or missing Sold To Address Line 1. Valid length is 1 to 35 alphanumeric characters\"},{\"key\":\"128099\",\"value\":\"Invalid or missing Sold To Town/City. Valid length is 1 to 30 alphanumeric characters\"},{\"key\":\"128101\",\"value\":\"Invalid Sold To Postcode. Valid length is 0 to 9 alphanumeric characters\"},{\"key\":\"128112\",\"value\":\"Invalid Monetary Value for Insurance. Valid length is 0 to 15 numeric characters and can hold up to 2 decimal places.\"},{\"key\":\"128113\",\"value\":\"Invalid Product Description. Valid range is 0 to 35 alphanumeric characters\"},{\"key\":\"128115\",\"value\":\"Invalid or missing Sold To Phone Number. Valid length is 1 to 15 alphanumeric characters.\"},{\"key\":\"128116\",\"value\":\"Invalid Sold To Tax Identification Number. Valid length is 1 to 15 alphanumeric characters.\"},{\"key\":\"128117\",\"value\":\"Invalid or missing Shipper Tax Identification.\"},{\"key\":\"128118\",\"value\":\"Invalid Licence Information. Either the licence number and licence date or the licence exception code and ECCN number must be present. Both the combinations cannot be present together.\"},{\"key\":\"128122\",\"value\":\"Invalid Net Cost Date Range.\"},{\"key\":\"128124\",\"value\":\"Invalid Blanket Period.\"},{\"key\":\"128125\",\"value\":\"Invalid or missing Ship FromTax Identification.\"},{\"key\":\"128211\",\"value\":\"Invalid Email Address\"},{\"key\":\"128212\",\"value\":\"Invalid or missing Ship To Tax Identification.\"},{\"key\":\"128213\",\"value\":\"Invalid or missing Producer Contact Name. Valid value is 1 to 35 alphanumeric characters\"},{\"key\":\"128214\",\"value\":\"Invalid Telephone Extension. Valid length is 1 to 4 alphanumeric characters.\"},{\"key\":\"128219\",\"value\":\"A Blanket Period can not exceed 365 days.\"},{\"key\":\"128220\",\"value\":\"The Total Product units allocated to the parcels do not match.\"},{\"key\":\"128221\",\"value\":\"The product is not associated with a parcel.\"},{\"key\":\"128222\",\"value\":\"All parcels must have at least 1 product assigned.\"},{\"key\":\"128226\",\"value\":\"Exceeds the maximum number of International Forms (13) allowed per Shipment.\"},{\"key\":\"128227\",\"value\":\"Invalid or missing Parcel Number (the Product is selected to be placed in a Parcel that does not exist).\"},{\"key\":\"128232\",\"value\":\"Exceeds the maximum number of parcels allowed for the packing list\"},{\"key\":\"128233\",\"value\":\"The user-generated form&apos;s size exceeds the total allowable limit for a shipment of 5 MB.\"},{\"key\":\"128234\",\"value\":\"Invalid or missing Shipper Memo.\"},{\"key\":\"128239\",\"value\":\"Exceeds the maximum number of Document IDs (13) allowed per Shipment.\"},{\"key\":\"128242\",\"value\":\"Label Size is not provided in the CN22 form.\"},{\"key\":\"128243\",\"value\":\"Missing the No of Prints per Page value\"},{\"key\":\"128244\",\"value\":\"Missing the Label Print Type\"},{\"key\":\"128245\",\"value\":\"Missing the CN22 form Type\"},{\"key\":\"128246\",\"value\":\"Missing the CN22 Other Description in the CN22 form\"},{\"key\":\"128247\",\"value\":\"The CN22 Content is not provided in the CN22 form\"},{\"key\":\"128248\",\"value\":\"The total number of items associated with the content is invalid\"},{\"key\":\"128249\",\"value\":\"The description of the content provided in the CN22 form is invalid\"},{\"key\":\"128250\",\"value\":\"The total weight of the content provided in the CN22 form is invalid\"},{\"key\":\"128251\",\"value\":\"Total value of the items associated with the content in the CN22 form is invalid\"},{\"key\":\"128252\",\"value\":\"The currency code provided in the CN22 form is invalid\"},{\"key\":\"128253\",\"value\":\"The Weight format provided in the CN22 form is invalid.\"},{\"key\":\"128254\",\"value\":\"The CN22 form cannot be combined with any other form\"},{\"key\":\"128255\",\"value\":\"Air Freight Packing List and Parcel Packing List are not allowed together in the same shipment.\"},{\"key\":\"128256\",\"value\":\"Invalid Fold Here Text length.\"},{\"key\":\"128257\",\"value\":\"The country of origin associated with the content in the CN22 form is invalid.\"},{\"key\":\"128258\",\"value\":\"The tariff number associated with the content in the CN22 form is invalid.\"},{\"key\":\"128263\",\"value\":\"Missing or Invalid Forms EEI Filing Option. The EEI form should be filed\"},{\"key\":\"128264\",\"value\":\"Missing or Invalid Shipper or Ship From Tax ID Type. Correct value is needed for the EEI form\"},{\"key\":\"128266\",\"value\":\"Missing or Invalid Forms EEI Filing Option Pre-departure ITN Number\"},{\"key\":\"128268\",\"value\":\"Missing or Invalid Forms UPS Filed POA Code. Should indicate a one-off POA or Blanket POA\"},{\"key\":\"128269\",\"value\":\"Missing or Invalid Forms EEI Filing Option Email Address\"},{\"key\":\"128270\",\"value\":\"Missing or Invalid Forms Product Export Information\"},{\"key\":\"128271\",\"value\":\"Missing or Invalid Forms Product Schedule B Quantity (line 2)\"},{\"key\":\"128272\",\"value\":\"Missing or Invalid Forms Product Schedule B Unit of Measurement Code (line 2)\"},{\"key\":\"128273\",\"value\":\"Missing or Invalid Forms EEI Information Licence Code\"},{\"key\":\"128274\",\"value\":\"Missing or Invalid Forms EEI Information Licence Number\"},{\"key\":\"128275\",\"value\":\"Missing or Invalid Forms EEI Information Licence ECCN Number\"},{\"key\":\"128276\",\"value\":\"Missing or Invalid Forms EEI Information Licence Line Value\"},{\"key\":\"128277\",\"value\":\"Missing or Invalid Forms DDTC Information\"},{\"key\":\"128278\",\"value\":\"Missing or Invalid Forms DDTC Information ITAR Exemption Number\"},{\"key\":\"128279\",\"value\":\"Missing or Invalid Forms DDTC Information USML Category Code\"},{\"key\":\"128280\",\"value\":\"Missing or Invalid Forms DDTC Information Eligible Party Indicator\"},{\"key\":\"128281\",\"value\":\"Missing or Invalid Forms DDTC Information Registration Number\"},{\"key\":\"128282\",\"value\":\"Missing or Invalid Forms DDTC Information Quantity\"},{\"key\":\"128283\",\"value\":\"Missing or Invalid Forms DDTC Information Unit of Measurement Code\"},{\"key\":\"128284\",\"value\":\"Missing or Invalid Forms DDTC Information Significant Military Equipment Indicator\"},{\"key\":\"128285\",\"value\":\"Missing or Invalid Forms DDTC Information ACM Number\"},{\"key\":\"128286\",\"value\":\"Missing or Invalid Forms EEI Information Opt Out Notification\"},{\"key\":\"128287\",\"value\":\"Missing or Invalid Forms Exclude From EEI\"},{\"key\":\"128288\",\"value\":\"Missing or Invalid Forms Document Account Number not enrolled\"},{\"key\":\"128289\",\"value\":\"Missing or Invalid Forms EEI Information invalid for SDL shipment\"},{\"key\":\"128290\",\"value\":\"Missing or Invalid Forms EEI Information ITN or SRN\"},{\"key\":\"128291\",\"value\":\"Missing or Invalid Forms SDL shipment indication for products\"},{\"key\":\"129203\",\"value\":\"The account is not authorised for the UPS Exchange service\"},{\"key\":\"129204\",\"value\":\"The account is not authorised for the UPS Pack and Collect service\"},{\"key\":\"150000\",\"value\":\"Tracking service unavailable\"},{\"key\":\"190100\",\"value\":\"Invalid Shipment Identification Number.\"},{\"key\":\"250021\",\"value\":\"The data length is in error for Company Name\"},{\"key\":\"250022\",\"value\":\"The data length is in error for Address Line 1\"},{\"key\":\"250023\",\"value\":\"The data length is in error for Address Line 2\"},{\"key\":\"250024\",\"value\":\"The data length is in error for Address Line 3\"},{\"key\":\"250025\",\"value\":\"The data length is in error for Town/City\"},{\"key\":\"250028\",\"value\":\"The data length is in error for Postcode\"},{\"key\":\"250029\",\"value\":\"The data is in error for Phone Number\"},{\"key\":\"250030\",\"value\":\"Invalid Email Address\"},{\"key\":\"250035\",\"value\":\"The data length is in error for the contact person name\"},{\"key\":\"250036\",\"value\":\"The data length is in error for the contact person title\"},{\"key\":\"264002\",\"value\":\"Country Code is invalid or missing.\"},{\"key\":\"1270114\",\"value\":\"Invalid International Forms/In-Bond Code. Valid values are 67, 68, 70.\"},{\"key\":\"1270115\",\"value\":\"Missing International Forms/Entry Number.\"},{\"key\":\"1270116\",\"value\":\"Missing or Invalid International Forms/EEI Filing Option.\"},{\"key\":\"1270117\",\"value\":\"Missing International Forms/Contacts/Ultimate Consignee/Address/Country Code.\"},{\"key\":\"1270118\",\"value\":\"Missing International Forms/Parties To Transaction.\"},{\"key\":\"1270119\",\"value\":\"Invalid International Forms/Parties To Transaction.\"},{\"key\":\"1270120\",\"value\":\"Missing International Forms/Routed Transaction Indicator.\"},{\"key\":\"1270121\",\"value\":\"Invalid International Forms/Routed Transaction Indicator.\"},{\"key\":\"1270122\",\"value\":\"Invalid International Forms/UPS Filed/POA/Code. Should indicate a one-off POA or blanket POA.\"},{\"key\":\"1270123\",\"value\":\"Invalid International Forms/Contacts/Ultimate Consignee/Address/Country Code.\"},{\"key\":\"1270124\",\"value\":\"Invalid International Forms/Point of Origin (if County/Region Code length should be 2).\"},{\"key\":\"1270125\",\"value\":\"Invalid International Forms/Point of Origin (if FTZ Identifier length max should be 7).\"},{\"key\":\"9120201\",\"value\":\"Missing Parcel Description.\"},{\"key\":\"9120203\",\"value\":\"Missing or invalid Combination of parcel length, width and height values.\"},{\"key\":\"9120211\",\"value\":\"Missing or invalid Declared Value Currency Code.\"},{\"key\":\"9120212\",\"value\":\"Missing or invalid Declared Value Monetary Value.\"},{\"key\":\"9120213\",\"value\":\"Shipper Release is not allowed with the return service.\"},{\"key\":\"9120216\",\"value\":\"Missing or invalid Parcel Notification Code.\"},{\"key\":\"9120217\",\"value\":\"Missing Parcel Notification Email Information.\"},{\"key\":\"9120218\",\"value\":\"Missing or invalid Notification Email Address.\"},{\"key\":\"9120500\",\"value\":\"Freight Density Info container is required for a Density Based Rating request.\"},{\"key\":\"9120501\",\"value\":\"Adjusted Height of Container is required if the Adjusted Height Indicator is requested.\"},{\"key\":\"9120502\",\"value\":\"Missing or Invalid Value for Adjusted Height\"},{\"key\":\"9120503\",\"value\":\"Missing or Invalid Unit of Measurement for Adjusted Height\"},{\"key\":\"9120504\",\"value\":\"Missing the Handling Units container for a Density-Based Rating request.\"},{\"key\":\"9120505\",\"value\":\"Missing or Invalid Quantity for Handling Units.\"},{\"key\":\"9120506\",\"value\":\"Missing or Invalid Type for Handling Units.\"},{\"key\":\"9120507\",\"value\":\"Missing the Dimensions Container for Handling Units.\"},{\"key\":\"9120508\",\"value\":\"Missing or Invalid Height for Handling Units.\"},{\"key\":\"9120509\",\"value\":\"Missing or Invalid Length for Handling Units.\"},{\"key\":\"9120510\",\"value\":\"Missing or Invalid Width for Handling Units.\"},{\"key\":\"9120511\",\"value\":\"Missing or Invalid Unit of Measurement for Handling Units.\"},{\"key\":\"9120512\",\"value\":\"Invalid Unit Of Measurement.\"},{\"key\":\"9120513\",\"value\":\"Invalid Number of Handling Units.\"},{\"key\":\"9120812\",\"value\":\"Missing Product Weight Information.\"},{\"key\":\"9120813\",\"value\":\"Missing Product Weight Unit of Measurement information.\"},{\"key\":\"9120814\",\"value\":\"Missing Product Unit information.\"},{\"key\":\"9120815\",\"value\":\"Missing Product Unit of Measurement information.\"},{\"key\":\"9120816\",\"value\":\"Missing Schedule B information.\"},{\"key\":\"9120817\",\"value\":\"Missing Schedule B Unit of Measurement information.\"},{\"key\":\"9120818\",\"value\":\"Missing Blanket Period information.\"},{\"key\":\"9120819\",\"value\":\"Missing Licence information.\"},{\"key\":\"9126004\",\"value\":\"Parcel Service Option HazMat Quantity is absent or doesn&apos;t meet specifications.\"},{\"key\":\"9126005\",\"value\":\"Dry Ice Weight is absent or doesn&apos;t meet specifications.\"},{\"key\":\"9126006\",\"value\":\"Parcel Service Option HazMat Transportation Mode has an invalid value.\"},{\"key\":\"9126007\",\"value\":\"The Dry Ice Weight Unit of Measurement Code has an invalid value.\"},{\"key\":\"9126030\",\"value\":\"Parcel Service Option HazMat Regulation required or has an invalid value.\"},{\"key\":\"9126044\",\"value\":\"The Dry Ice Regulation is required or has invalid value.\"},{\"key\":\"9129087\",\"value\":\"Invalid Shipment delivery confirmation/signature Type\"},{\"key\":\"9500505\",\"value\":\"The current address is not valid or missing information for the collection; please update the address.\"},{\"key\":\"9500523\",\"value\":\"Missing or invalid account number\"},{\"key\":\"9500684\",\"value\":\"No Drop-Off UPS Facilities available for this location\"},{\"key\":\"9500685\",\"value\":\"No Hold for Collection UPS Facility available for this location\"},{\"key\":\"9500686\",\"value\":\"Drop-off time must be with in Facility&apos;s hours of operations\"},{\"key\":\"9500687\",\"value\":\"UPS Smart Collection? cannot be mixed with WW Express Freight shipment\"},{\"key\":\"9500693\",\"value\":\"The maximum per-pallet weight for the selected service from the selected origin is %maxWeightOrig% pounds.\"},{\"key\":\"9500694\",\"value\":\"The maximum per-pallet weight for the selected service from the selected origin is %maxWeightOrig% kg.\"},{\"key\":\"9500695\",\"value\":\"The maximum per-pallet weight for the selected service to the selected destination is %maxWeightDest% pounds.\"},{\"key\":\"9500696\",\"value\":\"The maximum per-pallet weight for the selected service to the selected destination is %maxWeightDest% kg.\"},{\"key\":\"9500697\",\"value\":\"Exceeds maximum dimensions for package for the selected origin.\"},{\"key\":\"9500698\",\"value\":\"Exceeds maximum dimensions for package for the selected origin.\"},{\"key\":\"9500699\",\"value\":\"Exceeds maximum dimensions for package for the selected origin.\"},{\"key\":\"9500700\",\"value\":\"Exceeds maximum dimensions for package for the selected origin.\"},{\"key\":\"9510028\",\"value\":\"Today&apos;s collection could not be scheduled. Please select a new collection option.\"},{\"key\":\"9510029\",\"value\":\"Smart Collection is not available on this account.\"},{\"key\":\"9510110\",\"value\":\"Closing time is less than the minimum window after the present time\"},{\"key\":\"9510111\",\"value\":\"Closing time is less than the minimum window after ready time\"},{\"key\":\"9510112\",\"value\":\"Closing time and ready time are not on the same day\"},{\"key\":\"9510113\",\"value\":\"The ready time cannot be later than the latest allowable ready time for the location\"},{\"key\":\"9510114\",\"value\":\"Closing time must be later than or equal to the earliest allowable close time\"},{\"key\":\"9510115\",\"value\":\"No collection days available for this location\"},{\"key\":\"9510116\",\"value\":\"Non-serviceable area. The location does not have collection service available\"},{\"key\":\"9510117\",\"value\":\"The service(s) cannot be picked up based on your ready time due to invalid data\"},{\"key\":\"9510118\",\"value\":\"The service(s) is not available for collection on the selected day.\"},{\"key\":\"9510121\",\"value\":\"Sorry, we are unable to service your collection request on the day you have selected\"},{\"key\":\"9510122\",\"value\":\"Only future date collection is available for a collection request with only Germany to Germany UPS Standard shipments\"},{\"key\":\"9510123\",\"value\":\"The billing account information provided was invalid.\"},{\"key\":\"9510131\",\"value\":\"The order has already been cancelled\"},{\"key\":\"9510132\",\"value\":\"You cannot cancel an order that has already been completed\"},{\"key\":\"9510133\",\"value\":\"You cannot cancel an order that has an invalid state\"},{\"key\":\"9510134\",\"value\":\"Unknown order number (PRN). Order number not found in the data source\"},{\"key\":\"9510135\",\"value\":\"The provided collection date is not the Smart Collection eligible date\"},{\"key\":\"9510136\",\"value\":\"Next day&apos;s collection could not be scheduled. Please select a new collection option.\"},{\"key\":\"9510139\",\"value\":\"Smart Collection is not available for the provided country code\"},{\"key\":\"9510140\",\"value\":\"It is too late to cancel the collection request\"},{\"key\":\"9510142\",\"value\":\"The address information passed in was not enough to guarantee a unique location for a non-postal country.\"},{\"key\":\"9510153\",\"value\":\"The collection window start time must be before the end time\"},{\"key\":\"9510154\",\"value\":\"The account number provided does not belong to the user\"},{\"key\":\"9510155\",\"value\":\"The account number provided is not able to pay for the collection\"},{\"key\":\"9510156\",\"value\":\"The origin postcode is invalid for the selected location\"},{\"key\":\"9510160\",\"value\":\"The collection ready time cannot be later than the close time\"},{\"key\":\"9510163\",\"value\":\"The order cannot be cancelled with this PRN\"},{\"key\":\"9510164\",\"value\":\"Collection Address not found for the Account Number. Please set up Collection Address before you trigger UPS Smart Collection?\"},{\"key\":\"9510165\",\"value\":\"This account is not set up for UPS Smart Collection? services\"},{\"key\":\"9510166\",\"value\":\"Missing or Invalid Payment Card\"},{\"key\":\"9510167\",\"value\":\"Missing or invalid Payment Card Type\"},{\"key\":\"9510168\",\"value\":\"Missing or invalid Payment Card Expiry Date\"},{\"key\":\"9510169\",\"value\":\"Missing or invalid Payment Card Security Code\"},{\"key\":\"9510170\",\"value\":\"Missing or invalid Payment Card Number\"},{\"key\":\"9510171\",\"value\":\"The payment card has expired\"},{\"key\":\"9510172\",\"value\":\"Missing Payment Card Address\"},{\"key\":\"9510178\",\"value\":\"Payment card declined, contact your financial institution\"},{\"key\":\"9510179\",\"value\":\"This payment card has been locked due to multiple unsuccessful attempts. Please use another payment card to continue, or try again after 12 hours.\"},{\"key\":\"9510180\",\"value\":\"Invalid Cardholder Name\"},{\"key\":\"9510181\",\"value\":\"Invalid Payment Card Address Line\"},{\"key\":\"9510182\",\"value\":\"Invalid Payment Card Town/City\"},{\"key\":\"9510183\",\"value\":\"Invalid Payment Card County/Region\"},{\"key\":\"9510184\",\"value\":\"Invalid Payment Card Postcode\"},{\"key\":\"9510185\",\"value\":\"Missing or Invalid Payment Card Country Code\"},{\"key\":\"9560051\",\"value\":\"The promo code is invalid\"},{\"key\":\"9801002\",\"value\":\"Invalid Shipment/Reference Number/Value\"},{\"key\":\"9801003\",\"value\":\"Invalid or missing the earliest shipment collection time\"},{\"key\":\"9801004\",\"value\":\"Invalid Email Notification subject\"},{\"key\":\"9801005\",\"value\":\"Invalid Email Notification subject\"},{\"key\":\"9801006\",\"value\":\"No more than two email addresses for the Receiver of Return notifications are allowed in a shipment\"},{\"key\":\"9801014\",\"value\":\"Invalid Movement Reference Number\"},{\"key\":\"CPC1\",\"value\":\"Payment card authorisation failed, contact your financial institution.\"},{\"key\":\"CPC2\",\"value\":\"The Payment Card Billing Address and Security Code are required. Please update your payment card information.\"},{\"key\":\"CPC3\",\"value\":\"The number you entered is not a valid payment card number. Please try again.\"},{\"key\":\"CPC4\",\"value\":\"Incorrect expiry date (bad date or expired date) was encountered.\"},{\"key\":\"CPC5\",\"value\":\"Verification Code is required to complete your request.\"},{\"key\":\"CPC6\",\"value\":\"Error: VAT ID invalid. Insert the correct details to avoid billing as a final consumer.\"},{\"key\":\"CPC7\",\"value\":\"We&apos;re sorry. The payment card information cannot be processed. Please check for accuracy and try again, or enter another payment card.\"},{\"key\":\"9780000\",\"value\":\"Payment Card WS Unavailable.\"},{\"key\":\"9780002\",\"value\":\"Invalid Payment Card Number\"},{\"key\":\"9780003\",\"value\":\"Invalid Payment Card Number\"},{\"key\":\"9780004\",\"value\":\"Invalid Payment Card Type\"},{\"key\":\"9780005\",\"value\":\"Missing first name\"},{\"key\":\"9780006\",\"value\":\"Missing last name\"},{\"key\":\"9780007\",\"value\":\"Missing Postcode\"},{\"key\":\"9780008\",\"value\":\"Missing country code\"},{\"key\":\"9780009\",\"value\":\"Missing Payment Card Number\"},{\"key\":\"9780010\",\"value\":\"Missing Expiry Month\"},{\"key\":\"9780011\",\"value\":\"Missing Expiry Year\"},{\"key\":\"9780018\",\"value\":\"Missing Security Code\"},{\"key\":\"9780019\",\"value\":\"Missing Billing Address Container\"},{\"key\":\"9780022\",\"value\":\"Payment Card is Not Authorised\"},{\"key\":\"9780023\",\"value\":\"Missing or Invalid Payment Card Type\"},{\"key\":\"111535\",\"value\":\"Invalid Town/City/County/Region/Postcode Combination\"},{\"key\":\"127141\",\"value\":\"As of 1 January 2017, UPS Policy requires that all air shipments containing lithium ion and metal batteries packed alone to be transported as Section I.A or I.B fully regulated shipments. In addition, these changes also apply to UPS Ground service to Alaska, Hawaii and Puerto Rico, and UPS Standard service to select locations worldwide. Please refer to UPS.com for guidance to set up a UPS Dangerous Goods service agreement. Please select a different service.\"},{\"key\":\"9770038\",\"value\":\"Missing or Invalid PaymentMediaType\"},{\"key\":\"9661043\",\"value\":\"Missing or Invalid Postcode\"},{\"key\":\"9663001\",\"value\":\"An IMS Exception occurred when updating the address book\"},{\"key\":\"111580\",\"value\":\"Missing or invalid account number for payment information.\"},{\"key\":\"111595\",\"value\":\"The UPS account number provided as the payment method cannot be billed, please try another account.\"},{\"key\":\"120119\",\"value\":\"Shipper phone number and phone extension together cannot be more than 15 digits long\"},{\"key\":\"120551\",\"value\":\"Parcel Reference Number Value cannot be barcoded\"},{\"key\":\"120596\",\"value\":\"The requested payment option is not valid for this shipment\"},{\"key\":\"9631001\",\"value\":\"The selected account number cannot be used for this shipment.\"},{\"key\":\"9120083\",\"value\":\"The payment information must be the same for both Transportation Charges and Duty and Tax charges when Bill to Shipper or Bill to Receiver is specified as the payer.\"},{\"key\":\"9550105\",\"value\":\"The shipper account is invalid.\"},{\"key\":\"9550108\",\"value\":\"The account information entered is invalid.\"},{\"key\":\"transportationAccountInvalid\",\"value\":\"The transportation account is invalid.\"},{\"key\":\"dutiesAndTaxesAccountInvalid\",\"value\":\"The duties and taxes account is invalid.\"},{\"key\":\"bothAccountsInvalid\",\"value\":\"The transportation and duties and taxes accounts are not a valid pair.\"},{\"key\":\"EsbsDormantAccount\",\"value\":\"The status on this account is inactive. Please contact UPS. (UPS: 81482)\"},{\"key\":\"EsbsPaymentMethodUnacceptable\",\"value\":\"UPS internal security measures prevent the processing of this shipment. Please select a payment method other than a UPS account.\"},{\"key\":\"9778504\",\"value\":\"The billing address phone number is invalid. The number must be 14 digits or less.\"},{\"key\":\"110070\",\"value\":\"Missing or Invalid Quantity.\"},{\"key\":\"110071\",\"value\":\"Missing or Invalid CommodityRegulatedLevelCode.\"},{\"key\":\"110072\",\"value\":\"Missing or Invalid PackagingTypeQuantity.\"},{\"key\":\"110073\",\"value\":\"Missing or Invalid TransportCategory.\"},{\"key\":\"110074\",\"value\":\"Your UPS Account number is not authorised for Dangerous Goods shipments with ADR RegulationSet.\"},{\"key\":\"110075\",\"value\":\"Your UPS Account number is not authorised for Dangerous Goods shipments with ADR RegulationSet and Fully Regulated RegulatoryQuantityCode.\"},{\"key\":\"110076\",\"value\":\"Your UPS Account number is not authorised for Dangerous Goods shipments with CFR RegulationSet.\"},{\"key\":\"110077\",\"value\":\"Your UPS Account number is not authorised for Dangerous Goods shipments with IATA RegulationSet.\"},{\"key\":\"110078\",\"value\":\"Your UPS Account number is not authorised for Dangerous Goods shipments with TDG RegulationSet.\"},{\"key\":\"110079\",\"value\":\"Your UPS Account number is not authorised for Dangerous Goods shipments with CAO TransportationMode.\"},{\"key\":\"110080\",\"value\":\"Missing or Invalid QValue.\"},{\"key\":\"110081\",\"value\":\"Missing or Invalid ParcelIdentifier.\"},{\"key\":\"110082\",\"value\":\"Missing or Invalid ChemicalRecordIdentifier\"},{\"key\":\"110083\",\"value\":\"Both the PromoAliasCode and the PromoCode are required.\"},{\"key\":\"110086\",\"value\":\"Missing or Invalid OriginRecordTransactionTimestamp.\"},{\"key\":\"111401\",\"value\":\"Invalid regulation set. The regulation set for all chemical records in a parcel must be the same.\"},{\"key\":\"111606\",\"value\":\"SurePost is not compatible with Excepted Quantities of Dangerous Goods.\"},{\"key\":\"111607\",\"value\":\"Fully Regulated or Limited Quantities of Dangerous Goods, Excepted Quantities of Dangerous Goods, Lightly Regulated Lithium Batteries or Dry Ice cannot be combined in the same parcel.<\"},{\"key\":\"111608\",\"value\":\"Exceeded the maximum number of chemicals in parcel: %package.index%\"},{\"key\":\"111609\",\"value\":\"Mail Innovations is not compatible with Excepted Quantities of Dangerous Goods or Lightly Regulated Lithium Batteries.\"},{\"key\":\"111611\",\"value\":\"UPS Letters or UPS Envelopes are not compatible with Excepted Quantities of Dangerous Goods or Lightly Regulated Lithium Batteries.\"},{\"key\":\"112089\",\"value\":\"Missing or Invalid Chemical Record.\"},{\"key\":\"112092\",\"value\":\"Missing or Invalid Class Division Number.\"},{\"key\":\"112093\",\"value\":\"Missing or Invalid Transportation Mode.\"},{\"key\":\"112094\",\"value\":\"Missing or invalid phone number.\"},{\"key\":\"112102\",\"value\":\"?The shipment contains both Dry Ice and IDG parcels. The Dry Ice parcel(s) must use the regulation set associated with the IDG parcel(s)&apos;\"},{\"key\":\"112103\",\"value\":\"?The shipment contains both Dry Ice and IDG parcels. The transportation mode must be the same for Dry Ice and IDG parcels&apos;\"},{\"key\":\"112104\",\"value\":\"Invalid regulation set. The regulation set for all IDG records in a parcel must be the same&apos;\"},{\"key\":\"112108\",\"value\":\"The shipper is not eligible to ship Dry Ice.<\"},{\"key\":\"112112\",\"value\":\"Dangerous Goods cannot be shipped using UPS Import Control.\"},{\"key\":\"117059\",\"value\":\"EmergencyContact is required when EmergencyPhone is provided.\"},{\"key\":\"117060\",\"value\":\"Invalid EmergencyPhone. Emergency Phone Number must be a minimum of 10 characters with at least one numeric.\"},{\"key\":\"117061\",\"value\":\"RegulationSet must be 49CFR, TDG or ADR when TransportationMode is Ground.\"},{\"key\":\"117064\",\"value\":\"Black Powder (NA0027) cannot exceed 45 kg/100 lb per shipment.\"},{\"key\":\"117065\",\"value\":\"Smokeless Powder (NA3178) cannot exceed 45 kg/100 lb per shipment.\"},{\"key\":\"117066\",\"value\":\"TechnicalName is required for specified ProperShippingName.\"},{\"key\":\"117067\",\"value\":\"TechnicalName is not allowed for this shipment.\"},{\"key\":\"117068\",\"value\":\"Missing or Invalid ProperShippingName.\"},{\"key\":\"117069\",\"value\":\"Shipment Description is required for this shipment.\"},{\"key\":\"117071\",\"value\":\"The Net Quantity indicated exceeds the allowed maximum, based on chemical table validation.\"},{\"key\":\"117072\",\"value\":\"The Packing Instruction specified does not match the packing instruction expected, based on chemical table validation.\"},{\"key\":\"117073\",\"value\":\"The Packing Instruction specified does not match the packing instruction expected, based on chemical table validation. The packing instruction should be blank.\"},{\"key\":\"117074\",\"value\":\"Parcel Type must be specified when the parcel is not Part of All Packed in One.\"},{\"key\":\"117075\",\"value\":\"Net Quantity/TI must be specified.\"},{\"key\":\"117077\",\"value\":\"Missing or Invalid UOM for a given Quantity.\"},{\"key\":\"117079\",\"value\":\"Missing or Invalid PackagingGroupType for this shipment.\"},{\"key\":\"117082\",\"value\":\"Missing or Invalid SubRiskClass.\"},{\"key\":\"117083\",\"value\":\"Lighter authentication (LAA) number required ? Remarks must be entered or the parcel rejected.\"},{\"key\":\"117084\",\"value\":\"TI Unit of Measure must be selected for Class Division Number 7.\"},{\"key\":\"117085\",\"value\":\"Q Value must be N/A when there are no All Packed in One Basic Descriptions.\"},{\"key\":\"117086\",\"value\":\"UPS does not offer Biological Substances, Category B service from the selected origin country/postcode.\"},{\"key\":\"117087\",\"value\":\"UPS does not offer service for the provided chemical record from the specified origin country/postcode.\"},{\"key\":\"117088\",\"value\":\"A single ChemicalRecord cannot be All Packed in One.\"},{\"key\":\"117089\",\"value\":\"Overpack is required for a shipment with three ChemicalRecords where only two ChemicalRecords are All Packed in One.\"},{\"key\":\"117090\",\"value\":\"The APIO total net quantity exceeds the lowest permitted maximum net quantity.\"},{\"key\":\"117091\",\"value\":\"The Net Quantity Weight exceeds the limit for the specified Risk Class, Sub Risk and Packing Group combination. Risk Class 2.2 cannot exceed 75 kg.\"},{\"key\":\"117092\",\"value\":\"The Net Quantity Weight exceeds the 25 kg limit for the given specified ClassDivisionNumber, SubRiskClass and PackingGroupType combination.\"},{\"key\":\"117093\",\"value\":\"CAO Quantities of Class 1 Explosives are not allowed to the specified destination country.\"},{\"key\":\"117094\",\"value\":\"Unable to determine a single chemical record. Acceptance Audit Pre-Check cannot be performed.\"},{\"key\":\"117095\",\"value\":\"CAO Quantities of Class 1 Explosives are not allowed from the specified origin country.\"},{\"key\":\"117096\",\"value\":\"Invalid TunnelRestrictionCode for a given Hazardous material parcel using ADR RegulationSet.\"},{\"key\":\"117097\",\"value\":\"Invalid TransportCategory for a given Hazardous material parcel using ADR RegulationSet.\"},{\"key\":\"117099\",\"value\":\"Fully regulated commodities are prohibited to/from Great Britain for the specified service level. Great Britain channel passage not allowed for fully regulated commodities.\"},{\"key\":\"117101\",\"value\":\"UPS does not offer dangerous goods for the requested service from the selected origin country to selected destination country.\"},{\"key\":\"117105\",\"value\":\"A ShipTo postcode is required to verify if dangerous goods service is available to the selected destination country otherwise the shipment will be rejected.\"},{\"key\":\"117110\",\"value\":\"Regulation Set is not valid for the destination country.\"},{\"key\":\"117111\",\"value\":\"UPS does not offer dangerous goods service from the selected Origin country/postcode.\"},{\"key\":\"117113\",\"value\":\"UPS does not offer dangerous goods service to the selected Destination country/postcode.\"},{\"key\":\"117114\",\"value\":\"Missing or Invalid PackagingType.\"},{\"key\":\"117115\",\"value\":\"A ShipFrom PostCode is required to verify if dangerous goods service is available from the selected origin country, otherwise the shipment will be rejected.\"},{\"key\":\"117118\",\"value\":\"UPS does not offer Dry Ice service from the selected origin country/postcode.\"},{\"key\":\"117119\",\"value\":\"UPS does not offer Dry Ice service to the selected destination country/postcode.\"},{\"key\":\"117120\",\"value\":\"UPS does not offer Biological Substance, Category B service to the selected destination country/postcode.\"},{\"key\":\"117121\",\"value\":\"UPS does not offer service for the specified chemical record to the selected destination country/postcode.\"},{\"key\":\"117128\",\"value\":\"UPS does not offer service for the specified Commodity Regulated Level Code to selected Destination country.\"},{\"key\":\"117129\",\"value\":\"UPS does not offer service for the specified Commodity Regulated Level Code from the selected Origin country.\"},{\"key\":\"117130\",\"value\":\"Requested TransportationMode indicates that this item is forbidden, based on chemical table validation.\"},{\"key\":\"117131\",\"value\":\"The Regulation Set is not valid for the origin country.\"},{\"key\":\"117132\",\"value\":\"Excepted Quantities are not allowed from the selected origin country.\"},{\"key\":\"117133\",\"value\":\"Excepted Quantities are not allowed to the selected destination country.\"},{\"key\":\"117135\",\"value\":\"The specified origin country does not allow shipments of CAO quantities of Dangerous Goods.\"},{\"key\":\"117136\",\"value\":\"The Transportation Mode for ADR regulation set must be Ground.\"},{\"key\":\"117137\",\"value\":\"Mail Innovations is not a valid service for shipping all categories of dangerous goods.\"},{\"key\":\"117138\",\"value\":\"SurePost is not a valid service for shipping all categories of dangerous goods other than lightly regulated lithium batteries.\"},{\"key\":\"117139\",\"value\":\"The specified destination country does not allow shipments containing CAO quantities of Dangerous Goods.\"},{\"key\":\"117141\",\"value\":\"As of 1 January 2017, UPS Policy requires that all air shipments containing lithium ion and metal batteries packed alone to be transported as Section I.A or I.B fully regulated shipments. In addition, these changes also apply to UPS Ground service to Alaska, Hawaii and Puerto Rico, and UPS Standard service to select locations worldwide. Please refer to UPS.com for guidance to set up a UPS Dangerous Goods service agreement.\"},{\"key\":\"117142\",\"value\":\"Lightly regulated lithium batteries sent via SurePost cannot be shipped outside of the US48.\"},{\"key\":\"117143\",\"value\":\"Emergency Contact must not match the Emergency Phone Number.\"},{\"key\":\"117144\",\"value\":\"Emergency Phone Number contains an invalid entry.\"},{\"key\":\"117145\",\"value\":\"The UPS Shipper Account number is invalid to be used as the Emergency Contact.\"},{\"key\":\"117146\",\"value\":\"Technical Name must not match the Proper Shipping Name.\"}]}}}"
        }
    ],
    "body": [],
    "accessToken": ""
}